/*
function Person() {
    // Конструктор Person() определяет `this` как самого себя.
    this.age = 0;
  
    setInterval(function growUp() {
      // Без strict mode функция growUp() определяет `this`
      // как global object, который отличается от `this`
      // определённого конструктором Person().
      this.age++;
      console.log("=========================================================================================")
      console.log(this.age)
      console.log("=========================================================================================")
    }, 1000);
}
*/

function Person() {
    var self = this; // Некоторые выбирают `that` вместо `self`.
                     // Выберите что-то одно и будьте последовательны.
    self.age = 0;
  
    setInterval(function growUp() {
      // Колбэк ссылается на переменную `self`, 
      // значением которой является ожидаемый объект.
      self.age++;
      console.log("=========================================================================================")
      console.log(self.age)
      console.log("=========================================================================================")
    }, 1000);
  }

var p = new Person();
console.log("Finished")